       2 LTERM             CHAR(8),        /* LTERM NAME          */    ALTPCB
       2 RESVED            BIT(16),        /* RESERVED            */    ALTPCB
       2 STATCD            CHAR(2);        /* STATUS CODE         */    ALTPCB
