0  /*******************************************************************/00010000
   /* DRDMST :  DR1MST DATA                                           */00020000
   /*                                                                 */00030000
   /* WHEN    WHO  WHY   WHAT                                         */00040000
   /* ------- ---- ----- -------------------------------------------- */00050000
   /* 98MAR25 LJL  C971232  GLS - ADD EEDT, GLPI  REMOVE NIL, NILP    */00060001
   /* 90DEC13 GTRO CR507 CLEAN UP CODE                                */00061000
   /*******************************************************************/00070000
         2 DLET              CHAR (01),        /* DELETE FLAG         */00080000
         2 MADT              FIXED DEC (07,0), /* MICROFICHE ADD DATE */00090000
         2 MCDT              FIXED DEC (07,0), /* MICROFICHE CHGE DTE */00100000
         2 MCCD              FIXED DEC (03,0), /* MICROFICHE CHGE CDE */00110000
         2 DRDT              FIXED DEC (07,0), /* DOCUMENT REQURD DTE */00120000
         2 MSDT              FIXED DEC (07,0), /* MASTER STATUS DATE  */00130000
         2 MSCD              CHAR (01),        /* MASTER STATUS CODE  */00140000
         2 RRDT              FIXED DEC (07,0), /* LICENCE EXPIRY DTE  */00150000
         2 BIDT              FIXED DEC (07,0), /* BIRTHDATE           */00160000
         2 SEX               CHAR (01),        /* SEX                 */00170000
         2 STLI              CHAR (01),        /* SHORT TERM LIC IND. */00180000
         2 LMDT              FIXED DEC (07,0), /* LAST MEDICAL DATE   */00190000
         2 LEDT              FIXED DEC (07,0), /* LAST EXAM DATE      */00200000
         2 LCLS              CHAR (03),        /* LICENSE CLASS       */00210000
         2 DSDC              CHAR (03),        /* DISTRICT CODE       */00220000
         2 FRND              CHAR (01),        /* FILE REF INDICATOR  */00230000
         2 FRDT              FIXED DEC (07,0), /* FILE REFERENCE DATE */00240000
         2 FRNO              CHAR (07),        /* FILE REFERENCE NUM  */00250000
         2 RSCD (6)          CHAR (02),        /* RESTRICTION CODES   */00260000
         2 RSTX (2)          CHAR (22),        /* RESTRICTION TEXT    */00270000
         2 KEYW              CHAR (22),        /* KEYWORD             */00280000
         2 ADDT              FIXED DEC (07,0), /* ADDRESS DOC DATE    */00290000
         2 ADNO              CHAR (07),        /* ADDRESS DOC NUMBER  */00300000
         2 ADCD              CHAR (01),        /* ADDRESS CODE        */00310000
         2 POST              CHAR (06),        /* POSTAL CODE         */00320000
         2 ADDR (4)          CHAR (22),        /* ADDRESS LINE        */00330000
         2 JURI              CHAR (02),        /* JURISDICTION CODE   */00340000
         2 JNUM              CHAR (25),        /* JURISDICTION LIC NO */00350000
         2 HGHT              FIXED DEC (03,0), /* HEIGHT              */00360000
         2 WGHT              FIXED DEC (05,1), /* WEIGHT              */00370000
         2 EYEC              CHAR (03),        /* DRIVERS EYE COLOR   */00380000
         2 HAIR              CHAR (03),        /* DRIVERS HAIR COLOR  */00390000
         2 PID1              CHAR (16),        /* PRIMARY ID LINE 1   */00400000
         2 PID2              CHAR (16),        /* PRIMARY ID LINE 2   */00410000
         2 SID1              CHAR (16),        /* SECONDARY ID LINE 1 */00420000
         2 SID2              CHAR (16),        /* SECONDARY ID LINE 2 */00430000
         2 LCDT              FIXED DEC (7,0),  /* LICENCE CANCELL DTE */00440000
         2 EEDT              FIXED BIN (31),   /* ADV EARLY EXAM DATE */00450000
         2 GLPI              CHAR (01),        /* GRAD. LIC INDICATOR */00460001
