0  /*******************************************************************/00010009
   /* DRDSUSP:  SUSPENSION DATA FIELDS                                */00020009
   /*                                                                 */00030009
   /* WHEN    WHO  WHY   WHAT                                         */00040009
   /* ------- ---- ----- -------------------------------------------- */00050009
   /* 90DEC18 LYEE CR507 CLEAN UP DRIVER'S CODE                       */00060009
   /*******************************************************************/00070009
0       2 SRDT          FIXED DEC (07,0), /* REINSTATEMENT DATE       */00080009
        2 ADDT          FIXED DEC (07,0), /* DATE ADDED               */00090007
        2 DLDT          FIXED DEC (07,0), /* DATE DELETED             */00100007
