0  /*******************************************************************/00010002
   /* DRKFOTO:  DR1FOTO SEGMENT KEY                                   */00020002
   /*                                                                 */00030002
   /* WHEN    WHO  WHY   WHAT                                         */00040002
   /* ------- ---- ----- -------------------------------------------- */00050002
   /* 90DEC27 GTRO CR507 CLEAN UP DRIVER'S CODE                       */00060002
   /*******************************************************************/00070002
           3 LIDT            FIXED DEC (07,0),      /* LIC ISSUED DTE */00080002
           3 LINO            CHAR (07),             /* LIC ISSUED DOC */00090002
