0  /*******************************************************************/00010008
   /* DRKSUSP:  SUSPENSION KEY FIELDS                                 */00020008
   /*                                                                 */00030008
   /* WHEN    WHO  WHY   WHAT                                         */00040008
   /* ------- ---- ----- -------------------------------------------- */00050008
   /* 90DEC18 LYEE CR507 CLEAN UP DRIVER'S CODE                       */00060008
   /*******************************************************************/00070008
0         3 SSDT        FIXED DEC (07,0), /* SUSPENSION DATE          */00080008
          3 SCAS        CHAR (06),        /* SUSPENSION CAUSE         */00090005
