0/*********************************************************************/
 /* DTSYSDT: DETERMINE AND FORMAT THE SYSTEM DATE                     */
 /*********************************************************************/
 /*                                                                   */
 /* WHEN       WHO  ID      WHAT                                      */
 /* ---------- ---- ------- ----------------------------------------- */
 /* 1998-02-25 HJB  C980241 ORIGINAL                                  */
 /*********************************************************************/
0 DCL DTSYSDT                    EXT ENTRY (PTR);
 /*-------------------------------------------------------------------*/
 /* DTSYSDTP CONTAINS THE STRUCTURE AND PTR TO BE PASSED TO DTSYSDT */
 /*-------------------------------------------------------------------*/
  %INCLUDE DTSYSDTP;
 /*-------------------------------------------------------------------*/
 /* SET THE POINTER ADDRESSES FOR THE SUBROUTINE                      */
 /*-------------------------------------------------------------------*/
  DTSYSDT_STR     = '';
  DTSYSDT_PTR     = ADDR(DTSYSDT_STR);
