0  /*******************************************************************/00010009
   /* LNDDESC:  LINE DESCRIPTION DATA                                 */00020009
   /*                                                                 */00030009
   /* WHEN    WHO  WHY   WHAT                                         */00040009
   /* ------- ---- ----- -------------------------------------------- */00050009
   /* 90DEC12 GTRO CR507 CLEAN UP CODE                                */00060009
   /*******************************************************************/00070009
         2 LNDS              CHAR (45),   /* DESCRIPTION              */00080008
         2 DLET              CHAR (01),   /* DELETE INDICATOR         */00090008
         2 SUID              CHAR (01),   /* SUSPENSION INDICATOR     */00100008
         2 CPID              CHAR (01),   /* CPIC INDICATOR           */00110008
         2 PRID              CHAR (01),   /* PARIS INDICATOR          */00120008
