0  /*******************************************************************/00010008
   /* LNKDESC:  LINE DESCRIPTION KEY                                  */00020008
   /*                                                                 */00030008
   /* WHEN    WHO  WHY   WHAT                                         */00040008
   /* ------- ---- ----- -------------------------------------------- */00050008
   /* 90DEC12 GTRO CR507 CLEAN UP CODE                                */00060008
   /*******************************************************************/00070008
           3 NAME            CHAR (04),   /* TABLE NAME               */00080007
           3 SECT            CHAR (01),   /* SECTION                  */00090007
           3 NMCD            CHAR (01),   /* NEW MASTER STATUS        */00100007
           3 NECD            CHAR (04),   /* NEW EXPANDED STATUS      */00110007
