 /*********************************************************************/
 /*  DLI FILTER                                                       */
 /*********************************************************************/
 DCL MTRHDLI               ENTRY EXTERNAL;
