 /* PLIINCL ***********************************************************/
 /* STATCMD: DRIVER STATUS COMMANDS                                   */
 /* OWNING SYSTEM: DSSM - DRIVER LICENCING SYSTEM                     */
 /*********************************************************************/
 /*                                                                   */
 /* WHEN       WHO  CR #     WHAT                                     */
 /* ---------- ---- -------- ---------------------------------------- */
 /* 2008-06-20 NK   AR51804  ADD RECENT                               */
 /* 2006-02-27 NK   C15030   ORIGINAL                                 */
 /*********************************************************************/
 DCL 1 STATCMD            STATIC,
       /*------------------------------------------------------------*/
       /*  DELETES A STATUS WITH A MATCHING PRIMARY KEY
       /*------------------------------------------------------------*/
       2 DELETE            FIXED BINARY(15,0) INIT(1),

       /*------------------------------------------------------------*/
       /*  SAME AS A DELETE EXCEPT ERRORS ARE IGNORED
       /*------------------------------------------------------------*/
       2 DELETE_IGNORE     FIXED BINARY(15,0) INIT(2),

       /*------------------------------------------------------------*/
       /*  INSERTS A DRIVER STATUS
       /*------------------------------------------------------------*/
       2 INSERT            FIXED BINARY(15,0) INIT(3),

       /*------------------------------------------------------------*/
       /*  DELETES ALL OCCURENCES OF A STATUS FROM A DRIVER
       /*------------------------------------------------------------*/
       2 PURGE             FIXED BINARY(15,0) INIT(4),


       /*------------------------------------------------------------*/
       /*  GET THE OCCURANCE OF AN SPECIFIED EXPANDED STATUS HAVING
       /*  THE GREATEST EFFECTIVE DATE
       /*------------------------------------------------------------*/
       2 RECENT            FIXED BINARY(15,0) INIT(5),

       /*------------------------------------------------------------*/
       /* END OF STAT_CMD STRUCTURE, ANY MORE COMMANDS COME BEFORE
       /* THIS
       /*------------------------------------------------------------*/
       2 END_OF_STRUCTURE  CHAR(00);
