1/*********************************************************************/
 /* PLI DECLARATION FOR TABLE USBY ATTRIBUTES (NULL)                  */
 /*********************************************************************/
 DCL USBY_AT(9)  BIN FIXED(15)   INIT((9) (0));
 DCL 1 USBY_A    BASED(ADDR(USBY_AT)),
      5 CLNO      FIXED BIN(15),
      5 AREF      FIXED BIN(15),
      5 SYST      FIXED BIN(15),
      5 USAK      FIXED BIN(15),
      5 UREL      FIXED BIN(15),
      5 USID      FIXED BIN(15),
      5 ACNN      FIXED BIN(15),
      5 NOVW      FIXED BIN(15),
      5 ALRT      FIXED BIN(15);
 USBY_AT(*) = 0;
